{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "10"}, {"size": "275"}]}}}, "outputs": {"tf.identity": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.transpose/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model/tf.math.reduce_mean/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "10"}, {"size": "275"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_100", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_40", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_43", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_39", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_44", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/Read_1/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_45", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_41", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_103", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_99", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/zeros"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_104", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_105", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_97", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_101", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_95", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.transpose/transpose", "op": "Transpose", "input": ["input_1", "StatefulPartitionedCall/model/tf.compat.v1.transpose/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_111", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_100", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_147"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_51", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_40", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_87"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_54", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_43", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_90"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_39", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_86"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_55", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_44", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_91"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_56", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_45", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_92"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_84"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_38", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_52", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_41", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_88"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_82"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_114", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_103", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_150"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_110", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_99", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_146"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_115", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_104", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_151"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_116", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_105", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_152"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_108", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_97", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_144"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_98", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_112", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_101", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_148"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_106", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_95", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_142"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model/tf.compat.v1.transpose/transpose", "StatefulPartitionedCall/model/lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_49", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_38", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_85"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/cond/_33/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_52", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_46"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_109", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_98", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_145"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/cond/_93/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_108", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_112", "^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_106"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57", "op": "LoopCond", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/cond/_33/while/Less"]}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117", "op": "LoopCond", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/cond/_93/while/Less"]}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_42", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_13_switch/_63", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_51", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_14_switch/_66", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_54", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_12_switch/_62", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_15_switch/_67", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_55", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_16_switch/_68", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_56", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/time_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_switch/_64", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_52", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1_switch/_61", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_49", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/input/_24_switch/_123", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_111", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/input/_25_switch/_126", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_114", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/input/_23_switch/_122", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_110", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/input/_26_switch/_127", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_115", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/input/_27_switch/_128", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_116", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/time_switch/_120", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_108", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_switch/_124", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_112", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_counter_switch/_118", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_106", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1_switch/_121", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_109", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_53", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/enter/_42", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_89"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_58:1"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/exit/_73", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2_1_switch/_61"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_counter_switch/_118:1"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/exit/_133", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2_1_switch/_121"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_65", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/merge/_53", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/LoopCond/_57"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_90", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_14_switch/_66:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_91", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_15_switch/_67:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_12_switch/_62:1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_15_switch/_67:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_92", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_16_switch/_68:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/input/_169", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/time_switch/_60:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_88", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/strided_slice_switch/_64:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/exit/_73", "StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_150", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/input/_25_switch/_126:1", "^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_151", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/input/_26_switch/_127:1", "^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/input/_23_switch/_122:1", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/input/_26_switch/_127:1", "^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_152", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/input/_27_switch/_128:1", "^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/input/_206", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/time_switch/_120:1", "^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_148", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/strided_slice_switch/_124:1", "^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/exit/_133", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_89", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_65:1", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_65:1", "Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/input/_169", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/input/_169", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_counter_switch/_58:1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/input/_206", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_counter_switch/_118:1", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_14_switch/_66:1", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/MatMul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/add_2", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/add_3", "^StatefulPartitionedCall/model/lstm/PartitionedCall/while/loop_body_control/_69"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_102", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_144", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/add_2", "^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_142", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/add_3", "^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.reduce_mean/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/transpose_1", "StatefulPartitionedCall/model/tf.math.reduce_mean/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/add", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/model/lstm/PartitionedCall/input/_16_switch/_68:1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_113", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/enter/_102", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_149"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/tf.math.reduce_mean/Mean", "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/split", "op": "Split", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/split/split_dim", "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_125", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/merge/_113", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/LoopCond/_117"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/PartitionedCall/while/body/_34/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/next_iteration/_149", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_125:1", "^StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/loop_body_control/_129"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/StatefulPartitionedCall/model/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_125:1", "Func/StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/input/_206", "StatefulPartitionedCall/model/lstm_1/PartitionedCall/while/body/_94/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, 